app/views/drinks/new.html.erb

      <%= f.label :category_id %>
      <%= f.select :category_id, Category.all.map{ |n| [n.name, n.id] } %>
---
SELECT "categories".* FROM "categories"