app/controllers/drinks_controller.rb

INSERT INTO "drinks" ("title", "description", "alcohol_level", "featured", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @drink = Drink.new(drink_params)
    if @drink.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 102]]
SELECT  "drinks".* FROM "drinks" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" LIMIT 25 OFFSET 0) subquery_for_count
---
  def index
    if params[:category_id]
      category = Category.find(params[:category_id].to_i)
      @drinks = Drink.page(params[:page])